VanessaVsLsfusion/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиИСебестоимость</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расчеты</name>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DefinedType.РасчетныйДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

VanessaVsLsfusion/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровИУслуг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

VanessaVsLsfusion/src/AccumulationRegisters/ПродажиИСебестоимость/ПродажиИСебестоимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажиИСебестоимость</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаПродажи</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаСебестоимости</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровИУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорСПокупателем</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорСПоставщиком</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

VanessaVsLsfusion/src/AccumulationRegisters/РасчетыСКонтрагентами/РасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокумент</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

VanessaVsLsfusion/src/Enums/ТипыДетализацииРасчетов/ТипыДетализацииРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДетализацииРасчетов</name>
  <enumValues>
    <name>ПоДоговору</name>
  </enumValues>
  <enumValues>
    <name>ПоРасчетнымДокументам</name>
  </enumValues>
</mdclass:Enum>

VanessaVsLsfusion/src/Documents/РеализацияТоваровИУслуг/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Сумма = Номенклатура.Итог("Сумма");
	НДС = Номенклатура.Итог("НДС");
	СуммаСНДС = Номенклатура.Итог("СуммаСНДС");
	
	Если Договор.ДетализацияРасчетов = Перечисления.ТипыДетализацииРасчетов.ПоРасчетнымДокументам Тогда
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение
			И Расчеты.Итог("Сумма") > СуммаСНДС Тогда
			Сообщить("Ошибка при проведении " + Ссылка + ", сумма расчетов больше суммы документа");
			Отказ = Истина;
		КонецЕсли;
		
	Иначе
		Расчеты.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = ПараметрыСеанса.ТекущийПользователь;
	Склад = Константы.СкладПоУмолчанию.Получить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.ПродажиИСебестоимость.Записывать = Истина;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслугНоменклатура.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(РеализацияТоваровИУслугНоменклатура.НомерСтроки) КАК НомерСтроки,
	|	СУММА(РеализацияТоваровИУслугНоменклатура.Количество) КАК КоличествоПродажи,
	|	СУММА(РеализацияТоваровИУслугНоменклатура.СуммаСНДС) КАК СуммаПродажи
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Номенклатура КАК РеализацияТоваровИУслугНоменклатура
	|ГДЕ
	|	РеализацияТоваровИУслугНоменклатура.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслугНоменклатура.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	НомерСтроки,
	|	КоличествоПродажи,
	|	СуммаПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ВложенныйЗапрос.НомерСтроки) КАК НомерСтроки,
	|	ВложенныйЗапрос.Партия КАК Партия,
	|	ВложенныйЗапрос.Партия.Контрагент КАК Поставщик,
	|	ВложенныйЗапрос.Партия.Договор КАК ДоговорСПоставщиком,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоПродажи) КАК КоличествоПродажи,
	|	СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток,
	|	МАКСИМУМ(ВложенныйЗапрос.СуммаПродажи) КАК СуммаПродажи,
	|	СУММА(ВложенныйЗапрос.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТНоменклатура.Номенклатура КАК Номенклатура,
	|		ВТНоменклатура.НомерСтроки КАК НомерСтроки,
	|		ТоварыНаСкладах.Партия КАК Партия,
	|		ВТНоменклатура.КоличествоПродажи КАК КоличествоПродажи,
	|		ЕСТЬNULL(ТоварыНаСкладах.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|		ВТНоменклатура.СуммаПродажи КАК СуммаПродажи,
	|		ЕСТЬNULL(ТоварыНаСкладах.СуммаОстаток, 0) КАК СуммаОстаток
	|	ИЗ
	|		ВТНоменклатура КАК ВТНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладах
	|			ПО ВТНоменклатура.Номенклатура = ТоварыНаСкладах.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТНоменклатура.Номенклатура,
	|		ВТНоменклатура.НомерСтроки,
	|		ТоварыНаСкладах.Партия,
	|		ВТНоменклатура.КоличествоПродажи,
	|		-ЕСТЬNULL(ТоварыНаСкладах.КоличествоОборот, 0),
	|		ВТНоменклатура.СуммаПродажи,
	|		-ЕСТЬNULL(ТоварыНаСкладах.СуммаОборот, 0)
	|	ИЗ
	|		ВТНоменклатура КАК ВТНоменклатура
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, Склад = &Склад) КАК ТоварыНаСкладах
	|			ПО ВТНоменклатура.Номенклатура = ТоварыНаСкладах.Номенклатура
	|				И (ТоварыНаСкладах.Регистратор = &Ссылка)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Партия,
	|	ВложенныйЗапрос.Партия.Контрагент,
	|	ВложенныйЗапрос.Партия.Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(КоличествоПродажи),
	|	СУММА(КоличествоОстаток),
	|	МАКСИМУМ(СуммаПродажи),
	|	СУММА(СуммаОстаток)
	|ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТНоменклатура";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзЗапросаПоТоварам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
	
	Пока ВыборкаИзЗапросаПоТоварам.Следующий() Цикл
		
		Если ВыборкаИзЗапросаПоТоварам.Номенклатура.Услуга Тогда
			Движение = Движения.ПродажиИСебестоимость.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаИзЗапросаПоТоварам.Номенклатура;
			Движение.Покупатель = Контрагент;
			Движение.ДоговорСПокупателем = Договор;
			Движение.СуммаПродажи = ВыборкаИзЗапросаПоТоварам.СуммаПродажи;
		ИначеЕсли ВыборкаИзЗапросаПоТоварам.КоличествоПродажи > ВыборкаИзЗапросаПоТоварам.КоличествоОстаток Тогда
			
			Сообщить("Ошибка при проведении " + Ссылка + ", отрицательный остаток товаров на складе:");
			Сообщить("	Товар " + ВыборкаИзЗапросаПоТоварам.Номенклатура + ": " + (ВыборкаИзЗапросаПоТоварам.КоличествоОстаток - ВыборкаИзЗапросаПоТоварам.КоличествоПродажи));
			
			Пока ВыборкаИзЗапросаПоТоварам.Следующий() Цикл
				
				Если ВыборкаИзЗапросаПоТоварам.Количество > ВыборкаИзЗапросаПоТоварам.КоличествоОстаток Тогда
					Сообщить("	Товар " + ВыборкаИзЗапросаПоТоварам.Номенклатура + ": " + (ВыборкаИзЗапросаПоТоварам.КоличествоОстаток - ВыборкаИзЗапросаПоТоварам.КоличествоПродажи));
				КонецЕсли;
				
			КонецЦикла;
			
			Отказ = Истина;
			
			Прервать;
			
		Иначе
			
			ОсталосьСписатьКоличество = ВыборкаИзЗапросаПоТоварам.КоличествоПродажи;
			ОсталосьСписатьСуммаПродажи = ВыборкаИзЗапросаПоТоварам.СуммаПродажи;
			
			ВыборкаИзЗапроса = ВыборкаИзЗапросаПоТоварам.Выбрать();
			
			Пока ВыборкаИзЗапроса.Следующий()
				И ОсталосьСписатьКоличество <> 0 Цикл
				
				Если ОсталосьСписатьКоличество > ВыборкаИзЗапроса.КоличествоОстаток Тогда
					
					ДвижениеКоличество = ВыборкаИзЗапроса.КоличествоОстаток;
					ДвижениеСуммаСебестоимости = ВыборкаИзЗапроса.СуммаОстаток;
					
					Если ВыборкаИзЗапроса.КоличествоПродажи = 0 Тогда
						ДвижениеСуммаПродажи = 0;
					Иначе
						ДвижениеСуммаПродажи = ОсталосьСписатьСуммаПродажи / ОсталосьСписатьКоличество * ВыборкаИзЗапроса.КоличествоОстаток;
					КонецЕсли;
					
					ОсталосьСписатьКоличество = ОсталосьСписатьКоличество - ДвижениеКоличество;
					ОсталосьСписатьСуммаПродажи = ОсталосьСписатьСуммаПродажи - ДвижениеСуммаПродажи;
					
				Иначе
					
					ДвижениеКоличество = ОсталосьСписатьКоличество;
					
					Если ВыборкаИзЗапроса.КоличествоОстаток = 0 Тогда
						ДвижениеСуммаСебестоимости = 0;
					Иначе
						ДвижениеСуммаСебестоимости = ВыборкаИзЗапроса.СуммаОстаток / ВыборкаИзЗапроса.КоличествоОстаток * ОсталосьСписатьКоличество;
					КонецЕсли;
					
					ДвижениеСуммаПродажи = ОсталосьСписатьСуммаПродажи;
					
					ОсталосьСписатьКоличество = 0;
					ОсталосьСписатьСуммаПродажи = 0;
					
				КонецЕсли;
				
				Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Номенклатура = ВыборкаИзЗапроса.Номенклатура;
				Движение.Партия = ВыборкаИзЗапроса.Партия;
				Движение.Количество = ДвижениеКоличество;
				Движение.Сумма = ДвижениеСуммаСебестоимости;
				
				Движение = Движения.ПродажиИСебестоимость.Добавить();
				Движение.Период = Дата;
				Движение.Номенклатура = ВыборкаИзЗапроса.Номенклатура;
				Движение.Покупатель = Контрагент;
				Движение.ДоговорСПокупателем = Договор;
				Движение.Поставщик = ВыборкаИзЗапроса.Поставщик;
				Движение.ДоговорСПоставщиком = ВыборкаИзЗапроса.ДоговорСПоставщиком;
				Движение.Партия = ВыборкаИзЗапроса.Партия;
				Движение.СуммаПродажи = ДвижениеСуммаПродажи;
				Движение.СуммаСебестоимости = ДвижениеСуммаСебестоимости;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.РасчетыСКонтрагентами.Записывать = Истина;
	
	Если Договор.ДетализацияРасчетов = Перечисления.ТипыДетализацииРасчетов.ПоРасчетнымДокументам Тогда
		
		ОставшаясяСумма = СуммаСНДС;
		
		Для А = 0 По Расчеты.Количество() - 1 Цикл
			
			Движение = Движения.РасчетыСКонтрагентами.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Договор = Договор;
			Движение.РасчетныйДокумент = Расчеты[А].РасчетныйДокумент;
			Движение.Сумма = Расчеты[А].Сумма;
			
			ОставшаясяСумма = ОставшаясяСумма - Расчеты[А].Сумма;
			
		КонецЦикла;
		
		Если ОставшаясяСумма <> 0 Тогда
			Движение = Движения.РасчетыСКонтрагентами.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Договор = Договор;
			Движение.РасчетныйДокумент = Ссылка;
			Движение.Сумма = ОставшаясяСумма;
		КонецЕсли;
		
	Иначе
		Движение = Движения.РасчетыСКонтрагентами.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = СуммаСНДС;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры
